cypress/fixtures/orders/order_to_be_refunded.json

{
  "contract": {
    "vendorListings": [{
      "slug": "sasha-grey-to-be-manipulated-to-debug-our-code-nsfw",
      "vendorID": {
        "peerID": "QmYWEo2SzZVkQHirvwB1gSNwgVHAN5xXuynYgvWvC9VcNa",
        "handle": "Rave",
        "pubkeys": {
          "identity": "CAESIFzmk19LngvahGU23uQ+Rwfu8seNgWaEgoTamOrhxJI0",
          "bitcoin": "Avt3Lz63x7Mj+wF0t9jrfc+ju6h07bLG+84VDe2v3bVz"
        },
        "bitcoinSig": "MEUCIQD6XK7Q1kTd6ORQvCjuZK+KDa/DMPZOihUH6k4dfhsyiwIgLQJBDlxHSbuZ/M+8Yqr5OFTJiWHzyg2CeT3ZgBRcuxA="
      },
      "metadata": {
        "version": 4,
        "contractType": "SERVICE",
        "format": "FIXED_PRICE",
        "expiry": "2019-11-15T05:19:10.084Z",
        "acceptedCurrencies": [
          "TBTC",
          "TLTC",
          "TZEC",
          "TBCH"
        ],
        "pricingCurrency": "USD",
        "language": "",
        "escrowTimeoutHours": 1,
        "coinType": "",
        "coinDivisibility": 100000000,
        "priceModifier": 0,
        "serviceRateMethod": "FIXED",
        "serviceClassification": "1345-1: Academic, University: Head of Department or Faculty"
      },
      "item": {
        "title": "Sasha Grey To Be Manipulated To Debug our Code (NSFW)",
        "description": "",
        "processingTime": "1 day",
        "price": 500,
        "nsfw": false,
        "tags": [
          "debug",
          "sianlasagalikesthis"
        ],
        "images": [{
          "filename": "image.png",
          "original": "QmRQZRfzLzk3w1mZXLw2gFoh1nJ3E2XozrCbFN1sC5m2Ux",
          "large": "QmYELwwhP2XNN1ftM8NQzE5QfDSQQ1oEbTgZWVH2siiuyy",
          "medium": "QmcDuU4vkojEDfi1NbzCSMYpUCwneYzxU4oN57R9yN4x12",
          "small": "QmcqzKXWZBGsW1deKAL6XQi2ysjCTa9DS6H7QtaWHkiWhN",
          "tiny": "QmVQQhZyoHcs9S7nHoVuERtiWSwBGF7XpgtKZtV9RGFE5S"
        }],
        "categories": [
          "1345-1"
        ],
        "grams": 0,
        "condition": "New",
        "skus": [{
          "productID": "",
          "surcharge": 0,
          "quantity": 0
        }]
      },
      "termsAndConditions": "",
      "refundPolicy": "",
      "location": {
        "latitude": "",
        "longitude": "",
        "plusCode": "",
        "addressOne": "",
        "addressTwo": "",
        "city": "",
        "state": "",
        "country": "",
        "zipCode": ""
      }
    }],
    "buyerOrder": {
      "refundAddress": "mxVXwJbjsefv4QC1tjPeDZhNXtjJckuTXa",
      "refundFee": 0,
      "shipping": {
        "shipTo": "",
        "address": "",
        "city": "",
        "state": "",
        "postalCode": "",
        "country": "NA",
        "addressNotes": ""
      },
      "buyerID": {
        "peerID": "PeerOfBuyer",
        "handle": "e.lprofessor",
        "pubkeys": {
          "identity": "CAESILYXzKj7SxzrQVXFWYAJtFLQzBM+2PmwgfxS2fawQte7",
          "bitcoin": "AlwZBb6yt4qhrd5wBwMJEUFcGHeiXkJuLF873V2Eikx3"
        },
        "bitcoinSig": "MEUCIQCPX7Vms4XcRCLPgYRphlf1KwDLm4gwp+a4RQtiJsDSkAIgJOzzYe+K9hVsvhz1xJ2pp8bt3J0IgoOeO7Lbl9bitbY="
      },
      "timestamp": "2019-10-15T05:27:18.989287300Z",
      "items": [{
        "listingHash": "zb2rhejsJgG5SRCkMYw3dxhRUGPeon3njKk1vxdUM3yUzU1vE",
        "quantity": 0,
        "quantity64": 1,
        "shippingOption": {
          "name": "",
          "service": ""
        },
        "memo": "",
        "paymentAddress": ""
      }],
      "payment": {
        "method": "ADDRESS_REQUEST",
        "moderator": "",
        "amount": 59863,
        "chaincode": "",
        "address": "",
        "redeemScript": "",
        "coin": "TBTC"
      },
      "ratingKeys": [
        "ApAhdKVSmNb+dMDVCDCJgBBzMVdxpFIoFwWOiAVQyX0n"
      ],
      "alternateContactInfo": "",
      "version": 2
    },
    "vendorOrderConfirmation": {
      "orderID": "QmeYt71uC13xdbZwsKvZdDiG5aGaTwFVHZqE1mofqEdzAB",
      "timestamp": "2019-10-15T05:27:21.827845200Z",
      "paymentAddress": "mkTEKWpFMRAKiAu1VpiCmNEaC4Z39AfgDs",
      "requestedAmount": 59863,
      "ratingSignatures": []
    },
    "signatures": [{
        "section": "LISTING",
        "signatureBytes": "Pyce2vrFepA2ugYaE5d+YvE/iQ8RA8Rwclv4e/r+zz2piQsKcPvSNbqEJPEka7ThHVukM8xZQxM/iW3Z5W0LCg=="
      },
      {
        "section": "ORDER",
        "signatureBytes": "hCfDaq16WHhhHXZl93KyugX/9qIK/RgfF7wqYm0zdSyjDkARDli26I+W7mzuntHumDx9O3nXOapCdsLfgRu2Aw=="
      },
      {
        "section": "ORDER_CONFIRMATION",
        "signatureBytes": "lQr0N96UzBrxfWj8yEQC964kSU663cEZ5tqZn2KObG7C2SNvOoFRRkvyjGBEZDrz4II2clrNnx7xWNz/xVo4Dw=="
      }
    ]
  },
  "state": "AWAITING_FULFILLMENT",
  "read": true,
  "funded": true,
  "unreadChatMessages": 0,
  "paymentAddressTransactions": [{
    "txid": "c3d33c184bc47c870447243dd75dd19237094e0cad14fc52ff6222aed6ec725d",
    "value": 59863,
    "confirmations": 2,
    "height": 1583019,
    "timestamp": "2019-10-15T05:45:48.540099800Z"
  }]
}