cypress/fixtures/orders/refunded_order.json

{
    "contract": {
      "vendorListings": [
        {
          "slug": "moderator-test",
          "vendorID": {
            "peerID": "QmW7yRaQMQQTe1gvC1SWMzRLDnaN3wUve6aYrYsqMB42FK",
            "handle": "Kimitzu",
            "pubkeys": {
              "identity": "CAESIKX2OM1r2otRNO2JlZnNMJQt5m1Ck57lnKbWgfrWyPgv",
              "bitcoin": "A0uKZuifiI7681Csa4O2208Uh3/TCQlSwAis2o/NwA1y"
            },
            "bitcoinSig": "MEQCIHmlmstMukJfXu+ekkLIV6whUH3pmkqivjHE5akbmEzGAiAXX9+QzLVJzqb/vNz52bwDNNT18Oo4/L8+TFb/gTjoNw=="
          },
          "metadata": {
            "version": 4,
            "contractType": "SERVICE",
            "format": "FIXED_PRICE",
            "expiry": "2019-11-08T07:09:54.395Z",
            "acceptedCurrencies": [
              "TBTC",
              "TLTC",
              "TZEC",
              "TBCH"
            ],
            "pricingCurrency": "USD",
            "language": "",
            "escrowTimeoutHours": 1,
            "coinType": "",
            "coinDivisibility": 0,
            "priceModifier": 0,
            "serviceRateMethod": "PER_HOUR",
            "serviceClassification": "2512-0: Software Developers"
          },
          "item": {
            "title": "Moderator Test",
            "description": "Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.",
            "processingTime": "1 day",
            "price": 1000,
            "nsfw": false,
            "tags": [
              "test"
            ],
            "images": [
              {
                "filename": "image.png",
                "original": "Qme8boERwveuZFzkV19SdLDmYmxxnGpUeet47XZ6VzZJkP",
                "large": "QmZ7VfqLP6MX4atFAPnHFDba2N2dKsXhiUMEqe4bv794EJ",
                "medium": "QmQDxtcZEteGTK1FS7DieNjCV4spn7rJEQJh35AP3WT28H",
                "small": "QmUBHSYDJHuYDFybqmqJK8LKXTxEExT31yFWCpUod8uPWw",
                "tiny": "QmaZWBci9HUqeHjsPs9mTHLAVZFqrv9s7pxHqAEf731763"
              }
            ],
            "categories": [
              "2512-0"
            ],
            "grams": 0,
            "condition": "New",
            "options": [],
            "skus": [
              {
                "productID": "moderator-test",
                "surcharge": 0,
                "quantity": 0
              }
            ]
          },
          "shippingOptions": [],
          "taxes": [],
          "coupons": [],
          "moderators": [
            "QmYuz7HMF5SDMKjyUj3zCTqiq2rhAkWpDoxjhre8MLiHPN"
          ],
          "termsAndConditions": "Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.",
          "refundPolicy": "",
          "location": {
            "latitude": "",
            "longitude": "",
            "plusCode": "",
            "addressOne": "",
            "addressTwo": "",
            "city": "",
            "state": "",
            "country": "PH",
            "zipCode": ""
          }
        }
      ],
      "buyerOrder": {
        "refundAddress": "n26r3wQNQk5BEPFCKEkkmmEAqbHVZ7mSGK",
        "refundFee": 0,
        "shipping": {
          "shipTo": "",
          "address": "",
          "city": "",
          "state": "",
          "postalCode": "",
          "country": "NA",
          "addressNotes": ""
        },
        "buyerID": {
          "peerID": "QmYWEo2SzZVkQHirvwB1gSNwgVHAN5xXuynYgvWvC9VcNa",
          "handle": "Rave",
          "pubkeys": {
            "identity": "CAESIFzmk19LngvahGU23uQ+Rwfu8seNgWaEgoTamOrhxJI0",
            "bitcoin": "Avt3Lz63x7Mj+wF0t9jrfc+ju6h07bLG+84VDe2v3bVz"
          },
          "bitcoinSig": "MEUCIQD6XK7Q1kTd6ORQvCjuZK+KDa/DMPZOihUH6k4dfhsyiwIgLQJBDlxHSbuZ/M+8Yqr5OFTJiWHzyg2CeT3ZgBRcuxA="
        },
        "timestamp": "2019-10-08T09:45:29.341000800Z",
        "items": [
          {
            "listingHash": "zb2rha5m4Qh2N8QPUGGFocRRb2RqnGdu1gRFUMM2KxvKibx7z",
            "quantity": 0,
            "quantity64": 1,
            "shippingOption": {
              "name": "",
              "service": ""
            },
            "memo": "",
            "paymentAddress": ""
          }
        ],
        "payment": {
          "method": "ADDRESS_REQUEST",
          "moderator": "",
          "amount": 122206,
          "chaincode": "",
          "address": "",
          "redeemScript": "",
          "coin": "TBTC"
        },
        "ratingKeys": [
          "AxbtoTQPoP/6FAiCNx4q5hJ3JxYlwmpax9a63IdI+p0O"
        ],
        "alternateContactInfo": "",
        "version": 2
      },
      "vendorOrderConfirmation": {
        "orderID": "QmPpq47UU1wntjpN9LxhBWav4HLKF1A115FBzKAgR16jSc",
        "timestamp": "2019-10-08T09:45:31.709856186Z",
        "paymentAddress": "mpvEx6CDV7pJqXptEeXY7su25kE5j35oeb",
        "requestedAmount": 122206
      },
      "refund": {
        "orderID": "QmPpq47UU1wntjpN9LxhBWav4HLKF1A115FBzKAgR16jSc",
        "timestamp": "2019-10-08T09:46:25.841532799Z",
        "refundTransaction": {
          "txid": "6b586c354b358722246138d319eaa383ac32319e4ba32118c503975353357354",
          "value": 122206
        },
        "memo": ""
      },
      "signatures": [
        {
          "section": "LISTING",
          "signatureBytes": "rCXLB0ww3A87+jCeHHHKe6DMFZa6gFl7XcxP8VbMedPBpGorcrDXzNGjATU4EGn5NDVcGfkwz+Xls/Fxhrv1CQ=="
        },
        {
          "section": "ORDER",
          "signatureBytes": "ibdM/QUneYwJd75P/kDWPiQQdgcertlOQyqVlvpAlcUSc0gdh+4tavBs5aTgMCyQxB8S+ei8o4+bLhtLzLPpAA=="
        },
        {
          "section": "ORDER_CONFIRMATION",
          "signatureBytes": "HD9zr7WePpjXap2NEYvrx00WFPdvYv/jqEzJjHT68M9UJ067DWrXbQQOwSlPc8rXWINgxfZMMSy93hfSFaAMAg=="
        }
      ]
    },
    "state": "REFUNDED",
    "read": true,
    "funded": true,
    "unreadChatMessages": 0,
    "paymentAddressTransactions": [
      {
        "txid": "13e669573aee17d4477d918145226f0b2547283758b6ba6e41e50aee1daf166a",
        "value": 122206,
        "confirmations": 92,
        "height": 1580761,
        "timestamp": "2019-10-08T09:45:41.989398800Z"
      }
    ],
    "refundAddressTransaction": {
      "txid": "6b586c354b358722246138d319eaa383ac32319e4ba32118c503975353357354",
      "value": 122206,
      "confirmations": 92,
      "height": 1580761,
      "timestamp": "2019-10-08T09:46:25.841532799Z"
    }
  }