cypress/fixtures/profile/refunding_seller.json

{
  "peerID": "PeerOfSellerThatCanRefund",
  "profile": {
    "about": "I am a software engineer most knowledgeable in developing web applications using NodeJS, Express, React, MongoDB, and Mocha. \n\nI mostly have academic experience in developing desktop, mobile, and web applications using the following tools and technologies:\n• Blockchain: Ethereum, Solidity\n• Front end: React, Angular, Angular2, Bootstrap, Material-UI\n• Back end: NodeJS (with ExpressJS or FeathersJS), PHP, Symfony\n• Database: MongoDB, MySQL\n• Testing: Mocha, Chimp\n• Desktop app: Java\n• Mobile app: MeteorJS, Cordova, Android-Native, React-Native\n• Other Technologies Used: Git, Gitlab CI/CD, Remix, VSCode, Ubuntu",
    "avatarHashes": {
      "large": "QmS2rooxPDMb7jQQuzK66Mysb39uYJhbzCGZeiv6WEY9UH",
      "medium": "QmdcFue1Sh1WFxB6MiJc4jx59hBtZcw6zDGBK2Kcp5Tzi4",
      "original": "QmXh2KFJ4BQV7HC1X9yTxcDatpUGia6fQJGnksaYYGk6aH",
      "small": "QmUdwzFmQqr2tAnnsBmfXWiStJJkRu1CNyocCmi6rj3K1R",
      "tiny": "QmTM1Q2AtomRSpAdH1LpFGDyuFv4jAcv2rfVrkL1JJFGGK"
    },
    "background": {
      "educationHistory": [],
      "employmentHistory": []
    },
    "bitcoinPubkey": "02fb772f3eb7c7b323fb0174b7d8eb7dcfa3bba874edb2c6fbce150dedafddb573",
    "colors": {
      "highlight": "#2BAD23",
      "highlightText": "#252525",
      "primary": "#FFFFFF",
      "secondary": "#ECEEF2",
      "text": "#252525"
    },
    "contactInfo": {
      "email": "newEmail@email.com",
      "phoneNumber": "",
      "social": [{
        "proof": "https://twitter.com/24th_Saint/status/1166938745167175681",
        "type": "twitter",
        "username": "@24th_saint"
      }],
      "website": ""
    },
    "currencies": ["TBCH", "TZEC", "TLTC", "TBTC"],
    "customFields": [],
    "customProps": {
      "programmerCompetency": "{}",
      "skills": "[]"
    },
    "extLocation": {
      "addresses": [{
        "addressOne": "",
        "addressTwo": "",
        "city": "",
        "country": "PH",
        "latitude": "",
        "longitude": "",
        "plusCode": "",
        "state": "",
        "zipCode": ""
      }],
      "billing": 0,
      "primary": 0,
      "return": 0,
      "shipping": 0
    },
    "handle": "Rave",
    "headerHashes": {
      "large": "",
      "medium": "",
      "original": "",
      "small": "",
      "tiny": ""
    },
    "lastModified": "2019-10-15T05:20:48.963138800Z",
    "location": "PH, ",
    "metaTags": {
      "DjaliVersion": "0.0.1-dev"
    },
    "moderator": false,
    "moderatorInfo": {
      "acceptedCurrencies": ["TBCH", "TZEC", "TLTC", "TBTC"],
      "description": "",
      "fee": {
        "feeType": "FIXED",
        "fixedFee": {
          "amount": 0,
          "currencyCode": ""
        },
        "percentage": 0
      },
      "languages": [],
      "termsAndConditions": ""
    },
    "name": "Rave",
    "nsfw": false,
    "peerID": "PeerOfSellerThatCanRefund",
    "preferences": {
      "cryptocurrency": "TBTC",
      "currencyDisplay": "FIAT",
      "fiat": "USD",
      "language": "en-US",
      "measurementUnit": "METRIC"
    },
    "profileType": "djali",
    "shortDescription": "I am a software engineer most knowledgeable in developing web applications using NodeJS, Express, React, MongoDB, and Mocha...",
    "stats": {
      "averageRating": 0,
      "followerCount": 0,
      "followingCount": 0,
      "listingCount": 1,
      "postCount": 0,
      "ratingCount": 0
    },
    "vendor": true
  },
  "lastPing": 1571121310
}